Revit 2027 API
BuiltInFailures.RebarFailures.IncompleteShape Property
 Rebar Shape [Family Name] is not fully defined and cannot be loaded into the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IncompleteShape { get; }
Public Shared ReadOnly Property IncompleteShape As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IncompleteShape {
	FailureDefinitionId^ get ();
}
static member IncompleteShape : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace